Repository: 84000/data-translation-memory
Catalog: toh317_84000-distinctly-ascertaining-the-meanings.tmx
Source language: bo
Languages: en

source: དེ་བཞིན་གཤེགས་པའི་སྐྱེས་བུ་ཆེན་པོའི་མཚན་ཞབས་ཤིན་ཏུ་གནས་པ་འདི་དང་། ཞབས་ཀྱི་འོག་གི་མཐིལ་གཉིས་འཁོར་ལོའི་མཚན་དང་ལྡན་པ་དང་། རྟིང་པ་ཡངས་ཤིང་ཞབས་བྱིན་གྱིས་མཐོ་བ་དང་། སོར་མོ་རིང་བ་དང་། ཕྱག་དང་ཞབས་དྲ་བས་འབྲེལ་པ་དང་། ཕྱག་དང་ཞབས་འཇམ་ཞིང་གཞོན་ཤ་ཆགས་པ་དང་། བདུན་མཐོ་བའི་སྐུ་དང་ལྡན་པ་དང་། བྱིན་པ་རི་དགས་ཨེ་ན་ཡའི་ལྟ་བུ་དང་། མདོམས་ཀྱི་སྦ་བ་སྦུབས་སུ་ནུབ་པ་དང་། རོ་སྟོད་སེང་གེའི་འདྲ་བ་དང་། ཐལ་གོང་རྒྱས་པ་དང་། དཔུང་མགོ་ཤིན་ཏུ་ཟླུམ་པ་དང་། མ་བཏུད་པར་ཕྱག་པུས་མོར་སླེབས་པ་དང་། སྐུ་རྣམ་པར་དག་པ་དང་། མགུར་དུང་ལྟ་བུ་དང་། འགྲམ་པ་སེང་གེའི་འདྲ་བ་དང་། ཚེམས་བཞི་བཅུ་མཉམ་པ་དང་། ཚེམས་མཉམ་ཞིང་ཐགས་བཟང་བ་དང་། ཚེམས་ཤིན་དུ་དཀར་བ་དང་། ལྗགས་ཤིན་ཏུ་རིང་བ་དང་། རོ་བྲོ་བའི་མཆོག་དང་ལྡན་པ་དང་། ཚངས་པའི་དབྱངས་དང་། བྱ་ཀ་ལ་པིང་ཀའི་སྒྲ་དབྱངས་དང་། སྤྱན་མཐོན་མཐིང་དང་། སྤྱན་གྱི་རྫི་མ་བའི་འདྲ་བ་དང་། པགས་པ་སྲབ་པ་དང་། པགས་པའི་མདོག་གསེར་འདྲ་བ་དང་། སྤུའི་ཁུང་བུ་རེ་རེ་བ་དང་སྤུ་གྱེན་དུ་གཡས་ཕྱོགས་སུ་འཁྱིལ་པ་དང་། དབུ་སྐྲ་རིན་པོ་ཆེ་ཨན་ད་རྙིལ་ལྟ་བུ་དང་། སྨིན་མཚམས་ཀྱི་སྒོའི་བར་གྱི་འཕྲལ་བའི་སྤུ་ཤིན་ཏུ་དཀར་བ་དང་། དབུ་གཙུག་ཏོར་དང་ལྡན་པ་དང་། དེ་བཞིན་གཤེགས་པའི་སྐུ་ཤིང་ནྱ་གྲོ་དྷ་ལྟར་ཆུ་ཞེང་གབ་པ་དང་། ཀུན་ཏུ་མཛེས་པ་འདི་ནི་སྐྱེས་བུ་ཆེན་པོའི་མཚན་ཏེ།
en: “He has the Tathāgata’s mark of a great person that consists in having well-placed feet. . “The two soles of his feet are marked by a wheel. 3. “He has broad heels and prominent ankles. 4. “He has long fingers. 5. “His hands and feet are webbed. 6. “His hands and feet are soft and tender. 7. “There are seven elevations on his body. 8. “He has antelope shanks. 9. “His secret organ is retracted within a sheath. 10. “The upper half of his body is like a lion’s. 11. “The space between the shoulders is broad. 1 . “He has evenly rounded shoulders. 13. “His arms stretch to the knees when he does not bend down. 14. “His body is pure. 15. “His neck is like a conch. 16. “He has a lion’s jaw. 17. “He has forty even teeth. 18. “His teeth are even and have no interstices. 19. “He has very white teeth. 0. “He has a long tongue. 1. “Any flavor for him tastes supreme. . “His melodious voice is like the melodious voice of Brahmā and like the kalaviṅka’s note. 3. “He has intensely blue eyes. 4. “His eyelashes are like those of a cow. 5. “He has fine skin. 6. “He has golden skin. 7. “He has one hair for each pore. 8. “Each bodily hair points upward and turns to the right. 9. “The hair on his head is like sapphire. 30. “He has a very white ūrṇā on his forehead, the part of the face between the brows. 31. “He bears the uṣṇīṣa on his head. 3 . “He has the mark of a great person that consists in his body’s girth being like a banyan tree and all-around pleasant.

source: འདི་དག་ནི་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་སོ།
en: “These are the thirty-two marks of a great person. 1. “He has well-placed feet:

source: །དེ་བཞིན་གཤེགས་པའི་སྐྱེས་བུ་ཆེན་པོའི་སྐྱེས་བུ་ཆེན་པོའི་མཚན་ཞབས་ཤིན་ཏུ་གནས་པ་འདི་ནི་སྔོན་ཡི་དམ་ལ་བརྟན་པས་མངོན་པར་གྲུབ་པའོ།
en: this mark of a great person has come about because in the past the Tathāgata, the great person, pursued his undertakings with a firm resolve.

source: །དེ་བཞིན་གཤེགས་པའི་སྐྱེས་བུ་ཆེན་པོའི་སྐྱེས་བུ་ཆེན་པོའི་མཚན་ཞབས་ཀྱི་འོག་གི་མཐིལ་གཉིས་འཁོར་ལོའི་མཚན་དང་ལྡན་པ་འདི་ནི་སྔོན་སྦྱིན་པ་སྣ་ཚོགས་བསགས་པས་མངོན་པར་གྲུབ་པའོ།
en: “The two soles of his feet are marked by a wheel: this mark of a great person has come about because in the past the Tathāgata, the great person, accumulated manifold acts of generosity. 3. “He has broad heels and prominent ankles:

source: །དེ་བཞིན་གཤེགས་པའི་སྐྱེས་བུ་ཆེན་པོའི་སྐྱེས་བུ་ཆེན་པོའི་མཚན་རྟིང་པ་ཡངས་ཤིང་ཞབས་བྱིན་གྱིས་མཐོ་བ་འདི་ནི་སྔོན་སེམས་ཅན་གཞན་ལ་སྤ་བཀོང་བ་མ་བྱས་པས་མངོན་པར་གྲུབ་པའོ།
en: this mark of a great person has come about because in the past the Tathāgata, the great person, did not intimidate other sentient beings. 4. “He has long fingers:

source: །དེ་བཞིན་གཤེགས་པའི་སྐྱེས་བུ་ཆེན་པོའི་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སོར་མོ་རིང་བ་འདི་ནི་སྔོན་སེམས་ཅན་རྣམས་ལ་ཆོས་ཀྱིས་བསྲུང་བ་དང་། བསྐྱབ་པ་དང་། སྦ་བ་བྱས་པས་མངོན་པར་གྲུབ་པའོ།
en: this mark of a great person has come about because in the past the Tathāgata, the great person, protected, sheltered, and guarded the Dharma for sentient beings. 5. “His hands and feet are webbed:

source: །དེ་བཞིན་གཤེགས་པའི་སྐྱེས་བུ་ཆེན་པོའི་སྐྱེས་བུ་ཆེན་པོའི་མཚན་ཕྱག་དང་ཞབས་དྲ་བས་འབྲེལ་བ་འདི་ནི་སྔོན་གཡོག་འཁོར་གྱི་དབྱེན་མ་བྱས་པས་མངོན་པར་གྲུབ་པའོ།
en: this mark of a great person has come about because in the past the Tathāgata, the great person, did not break up others’ retinues. 6. “His hands and feet are soft and tender:

source: །དེ་བཞིན་གཤེགས་པའི་སྐྱེས་བུ་ཆེན་པོའི་སྐྱེས་བུ་ཆེན་པོའི་མཚན་ཕྱག་དང་། ཞབས་འཇམ་ཞིང་གཞོན་ཤ་ཆགས་པ་འདི་ནི་སྔོན་གོས་དམ་པ་སྣ་ཚོགས་རབ་ཏུ་བྱིན་པས་མངོན་པར་གྲུབ་པའོ།
en: this mark of a great person has come about because in the past the Tathāgata, the great person, offered many types of fine garments. 7. “There are seven elevations on his body:

source: །དེ་བཞིན་གཤེགས་པའི་སྐྱེས་བུ་ཆེན་པོའི་སྐྱེས་བུ་ཆེན་པོའི་མཚན་བདུན་མཐོ་བའི་སྐུ་དང་ལྡན་པ་འདི་ནི་སྔོན་བཟའ་བ་དང་། བཏུང་བ་རྒྱ་ཆེན་པོ་བྱིན་པས་མངོན་པར་གྲུབ་པའོ།
en: this mark of a great person has come about because in the past the Tathāgata, the great person, offered large quantities of food and drink. 8. “He has antelope shanks:

source: །དེ་བཞིན་གཤེགས་པའི་སྐྱེས་བུ་ཆེན་པོའི་སྐྱེས་བུ་ཆེན་པོའི་མཚན་བྱིན་པ་རི་དགས་ཨེ་ན་ཡའི་ལྟ་བུ་འདི་ནི་སྔོན་སངས་རྒྱས་ཀྱི་ཆོས་ཡོངས་སུ་བཟུང་བས་མངོན་པར་གྲུབ་པའོ།
en: this mark of a great person has come about because in the past the Tathāgata, the great person, embraced the Buddhadharma. 9. “His secret organ is placed within a sheath:

source: །དེ་བཞིན་གཤེགས་པའི་སྐྱེས་བུ་ཆེན་པོའི་སྐྱེས་བུ་ཆེན་པོའི་མཚན་མདོམས་ཀྱི་སྦ་བ་སྦུབས་སུ་ནུབ་པ་འདི་ནི་སྔོན་གསང་བའི་ཚིག་བསྲུངས་པ་དང་འཁྲིག་པའི་ཆོས་སྤངས་པས་མངོན་པར་གྲུབ་པའོ།
en: this mark of a great person has come about because in the past the Tathāgata, the great person, guarded the secret mantras, and because he gave up the copulation dharma. 10. “The upper half of his body is like a lion’s:

source: །དེ་བཞིན་གཤེགས་པའི་སྐྱེས་བུ་ཆེན་པོའི་སྐྱེས་བུ་ཆེན་པོའི་མཚན་རོ་སྟོད་སེང་གེའི་འདྲ་བ་འདི་ནི་སྔོན་དགེ་བའི་ལས་ཀུན་ཏུ་བསྲུངས་པས་མངོན་པར་གྲུབ་པའོ།
en: this mark of a great person has come about because in the past the Tathāgata, the great person, conducted himself in accordance with virtuous karma. 11. “The space between the shoulders is broad:

source: །དེ་བཞིན་གཤེགས་པའི་སྐྱེས་བུ་ཆེན་པོའི་སྐྱེས་བུ་ཆེན་པོའི་མཚན་ཐལ་གོང་རྒྱས་པ་འདི་ནི་སྔོན་དགེ་བའི་ཆོས་ཡང་དག་པར་སྤྱད་པས་མངོན་པར་གྲུབ་པའོ།
en: this mark of a great person has come about because in the past the Tathāgata, the great person, practiced virtuous dharmas. 1 . “He has evenly rounded shoulders:

source: །དེ་བཞིན་གཤེགས་པའི་དཔུང་མགོ་ཤིན་ཏུ་ཟླུམ་པ་འདི་ནི་སྡོན་གཞན་དག་ལ་དབུགས་འབྱིན་པ་བྱིན་པས་མངོན་པར་གྲུབ་པའོ།
en: this has come about because in the past the Tathāgata offered fearlessness and solace to others.

source: །དེ་བཞིན་གཤེགས་པའི་ཕྱག་མ་བཏུད་པར་པུས་མོར་སླེབས་པ་འདི་ནི་སྔོན་གཞན་ལ་བྱ་བ་ཅི་ཡོད་ཅེས་བྱ་བས་མངོན་པར་གྲུབ་པའོ།
en: “His arms stretch to the knees when he does not bend down: this has come about because in the past the Tathāgata was eager to perform tasks for others. 14. “His body is pure:

source: །དེ་བཞིན་གཤེགས་པའི་སྐུ་རྣམ་པར་དག་པ་འདི་ནི་སྔོན་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ངོམས་མི་མྱོང་བར་ཡང་དག་པར་སྤྱད་པས་མངོན་པར་གྲུབ་པའོ།
en: this has come about because in the past the Tathāgata was never satisfied with the extent to which he undertook the paths of the ten virtuous karmas. 15. “His neck is like a conch:

source: །དེ་བཞིན་གཤེགས་པའི་མགུར་དུང་ལྟ་བུ་འདི་ནི་སྔོན་ནད་པ་རྣམས་ལ་སྨན་སྣ་ཚོགས་བྱིན་པས་མངོན་པར་གྲུབ་པའོ།
en: this has come about because in the past the Tathāgata offered many types of medicines to the sick. 16. “He has a lion’s jaw:

source: །དེ་བཞིན་གཤེགས་པའི་འགྲམ་པ་སེང་གེའི་འདྲ་བ་འདི་ནི་སྔོན་དགེ་བའི་རྩ་བ་ཡོངས་སུ་རྫོགས་པར་བྱས་པས་མངོན་པར་གྲུབ་པའོ།
en: this has come about because in the past the Tathāgata fulfilled the practice of the roots of virtue. 17. “He has forty even teeth:

source: །དེ་བཞིན་གཤེགས་པའི་ཚེམས་བཞི་བཅུ་མཉམ་པ་འདི་ནི་སྔོན་སེམས་ཅན་ལ་མཚུངས་པར་གནས་སྦྱར་བས་མངོན་པར་གྲུབ་པའོ།
en: this has come about because in the past the Tathāgata acted evenly toward all sentient beings.

source: །དེ་བཞིན་གཤེགས་པའི་ཚེམས་ཐགས་བཟང་བ་འདི་ནི་སྔོན་སེམས་ཅན་བྱེ་བའི་སྡུམས་བྱས་པས་སོ།
en: “His teeth have no interstices: this has come about because in the past the Tathāgata united sentient beings who were divided. 19. “He has very white teeth:

source: །དེ་བཞིན་གཤེགས་པའི་ཆེམས་ཤིན་ཏུ་དཀར་བ་འདི་ནི་སྔོན་ཡིད་དུ་འོང་བ་རབ་ཏུ་བྱིན་པས་སོ།
en: this has come about because in the past the Tathāgata offered beautiful gifts. He has even teeth:

source: །ཚེམས་མཉམ་པ་ནི་སྔོན་ལུས་དང་ངག་དང་། ཡིད་ལས་ཀུན་ཏུ་བསྲུངས་པས་གྲུབ་པའོ།
en: this is because he guarded well the karmas of body, speech, and mind. 0. “He has a long tongue:

source: །དེ་བཞིན་གཤེགས་པའི་ལྗགས་ཤིན་ཏུ་རིང་བ་འདི་ནི་སྔོན་བདེན་པའི་ཚིག་ཡང་དག་པར་བསྲུངས་པས་གྲུབ་པའོ།
en: this has come about because in the past the Tathāgata guarded the truthfulness of his speech. 1. “Any flavor for him tastes supreme:

source: །དེ་བཞིན་གཤེགས་པའི་རོ་བྲོ་བའི་མཆོག་དང་ལྡན་པ་འདི་ནི་སྔོན་བསོད་ནམས་ཚད་མེད་པས་བདག་ཉེ་བར་བསྟན་ཅིང་གཞན་ལ་རབ་ཏུ་བྱིན་པས་གྲུབ་པའོ།
en: this has come about because in the past the Tathāgata attended to merit beyond measure and made offerings to others. . “His melodious voice is like the melodious voice of Brahmā and like the kalaviṅka’s note:

source: །དེ་བཞིན་གཤེགས་པའི་ཚངས་པའི་དབྱངས་དང་། བྱ་ཀ་ལ་པིང་ཀའི་སྒྲ་དབྱངས་འདི་ནི་སྔོན་སེམས་ཅན་ལ་ཚིག་འཇམ་པོ་སྨྲས་པ་དང་། ཀུན་ཏུ་དགའ་བའི་ཚིག་ཐོས་པར་བྱེད་པས་གྲུབ་པའོ།
en: this has come about because in the past the Tathāgata spoke gentle words to sentient beings, and because he proclaimed speech that gives joy. 3. “He has intensely blue eyes:

source: །དེ་བཞིན་གཤེགས་པའི་སྤྱན་མཐོན་མཐིང་འདི་ནི་སྔོན་བྱམས་པ་དང་ལྡན་པས་སེམས་ཅན་ཡང་དག་པར་བསྲུངས་པས་སོ།
en: this has come about because in the past the Tathāgata protected sentient beings with friendliness. 4. “His eyelashes are like those of a cow:

source: །སྤྱན་གྱི་རྫི་མ་བའི་འདྲ་བ་འདི་ནི་སྔོན་བསམ་པ་བཅོས་མ་མ་ཡིན་པས་སོ།
en: this has come about because in the past he kept an uncontrived disposition. 5. “He has fine skin:

source: །པགས་པ་སྲབ་པ་འདི་ནི་སྔོན་ཆོས་ཡང་དག་པར་སྡུད་པ་ལས་སུ་རུང་བས་མངོན་པར་གྲུབ་པའོ།
en: this has come about because in the past he became adept at perfectly chanting and collecting the Dharma. 6. “He has golden skin:

source: །དེ་བཞིན་གཤེགས་པའི་པགས་པའི་མདོག་གསེར་འདྲ་བ་འདི་ནི་སྔོན་མལ་ཆ་དང་། གདིང་བ་དང་། གོས་ཡིད་དུ་འོང་བ་བྱིན་པས་མངོན་པར་གྲུབ་པའོ།
en: this has come about because in the past the Tathāgata offered beds, seats, mats, and attractive garments. 7. “He has one hair for each pore:

source: །དེ་བཞིན་གཤེགས་པའི་སྤུའི་ཁུང་བུ་རེ་རེ་བ་འདི་ནི་སྔོན་འདུ་འཛི་ཡོངས་སུ་སྤངས་པས་མངོན་པར་གྲུབ་པའོ།
en: this has come about because in the past the Tathāgata avoided crowds. 8. “Each bodily hair points upward and turns to the right:

source: །དེ་བཞིན་གཤེགས་པའི་སྤུ་གྱེན་དུ་གཡས་ཕྱོགས་སུ་འཁྱིལ་བ་འདི་ནི་སྔོན་མཁན་པོ་དང་། སློབ་དཔོན་དང་། དགེ་བའི་བཤེས་གཉེན་གྱིས་རྗེས་སུ་བསྟན་པ་ལ་འཐུན་པར་འཛིན་པས་གྲུབ་པའོ།
en: this has come about because in the past the Tathāgata seized with courteous dexterity the instructions of his ācāryas, upādhyāyas, and good friends. 9. “The hair on his head is like sapphire:

source: །དེ་བཞིན་གཤེགས་པའི་དབུ་སྐྲ་རིན་པོ་ཆེ་ཨན་ད་རྙིལ་ལྟ་བུ་འདི་ནི་སྔོན་སེམས་ཅན་གྱི་སྲོག་ལ་སྙིང་བརྩེ་བ་དང་བོང་བ་དང་དབྱུག་པ་དང་མཚོན་ཆ་བོར་བས་གྲུབ་པའོ།
en: this has come about because in the past the Tathāgata had compassion for the lives of sentient beings, and because he laid aside stones, sticks, and blades. 30. “He has a very white ūrṇā on his forehead, the part of the face between the brows:

source: །དེ་བཞིན་གཤེགས་པའི་སྨིན་མཚམས་ཀྱི་སྒོའི་བར་གྱི་དཔྲལ་བའི་སྤུ་ཤིན་ཏུ་དཀར་བ་འདི་ནི་སྔོན་བསྔགས་པར་འོས་པ་རྣམས་ཀྱི་བསྔགས་པ་བརྗོད་པས་མངོན་པར་གྲུབ་པའོ།
en: this has come about because in the past the Tathāgata praised those worthy of praise. 31. “He bears the uṣṇīṣa on his head:

source: །དེ་བཞིན་གཤེགས་པའི་དབུ་གཙུག་ཏོར་དང་ལྡན་པ་འདི་ནི་སྔོན་བླ་མ་ལ་གུས་པར་བྱས་པས་མངོན་པར་གྲུབ་པའོ།
en: this has come about because in the past the Tathāgata showed reverence to his gurus. . “His body’s girth is like a banyan tree:

source: །དེ་བཞིན་གཤེགས་པའི་སྐུ་ཤིང་ནྱ་གྲོ་ལྟར་ཆུ་ཞེང་གབ་པ་འདི་ནི་སྔོན་བདག་དང་གཞན་ཏིང་ངེ་འཛིན་ལ་སྦྱོར་བས་མངོན་པར་གྲུབ་པའོ།
en: this has come about because in the past the Tathāgata enjoined himself and others toward samādhi.

source: །དེ་བཞིན་གཤེགས་པའི་སྐུ་སྲེད་མེད་ཀྱི་བུ་ཆེན་པོ་ལྟ་བུར་ཀུན་ཏུ་མཛེས་པ་འདི་ནི་སྔོན་དེ་བཞིན་གཤེགས་པའི་སྐུ་གཟུགས་བྱས་པ་དང་། མཆོད་རྟེན་ཞིག་པ་བཅོས་པ་དང་། གཞན་དག་འཇིགས་པ་ལས་དབུགས་དབྱུང་བ་བྱས་པས་གྲུབ་པ་སྟེ། དགེ་བའི་རྩ་བ་ཚད་མེད་པས་ཆོས་འདི་དག་ལ་དབང་སྒྱུར་བའི་ཕྱིར། དེ་བཞིན་གཤེགས་པའི་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་པོ་དག་སྐུ་ལ་མངོན་པར་གྲུབ་པའོ།
en: “That his body has the all-around pleasantness of Mahā­nārāyaṇa has come about because in the past he made images of the tathāgatas, repaired broken stūpas, and consoled others when they were scared. Thanks to roots of virtue beyond measure, he attained mastery in respect to these dharmas, and thus the thirty-two marks of a great person have come forth on the Tathāgata’s body.

source: །དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུ་གང་ཞེ་ན།
en: “What are the eighty minor marks? 1. “The buddhas, the bhagavats, have nails the color of copper, . “glossy nails, 3. “prominent nails, 4. “even lines on their palms, 5. “round fingers, 6. “plump fingers, 7. “regularly shaped fingers, 8. “hidden channels, 9. “channels without knots, 10. “hidden ankles, 11. “and level feet; . “the buddhas move with a lion-like gait; 13. “they move with an elephant-like gait; 14. “they move with a geese-like gait; 15. “they move with a bull-like gait; 16. “they move circling to the right; 17. “they move elegantly; 18. “they move without crookedness; 19. “they have rounded bodies, 0. “smooth bodies, 1. “and regularly shaped bodies; . “their bodies are wide and elegant; 3. “they are complete in their marks; 4. “they take even steps; 5. “they have clean bodies, 6. “soft bodies, 7. “pure bodies, 8. “unimpaired bodies, 9. “broad bodies, 30. “very firm bodies, 31. “and well-proportioned bodies; 3 . “their vision is free from defects and clear; 33. “they have round bellies, 34. “clean bellies, 35. “bellies without defects, 36. “slender stomachs, 37. “deep navels, 38. “and navels that turn to the right; 39. “they are all-around pleasant; 40. “they conduct themselves in a pure manner; 41. “their bodies have no freckles or moles; . “they have soft hands like cotton wool, 43. “glossy lines in the palms, 44. “deep lines in the palms, 45. “and long lines in the palms; 46. “their faces are not too long; 47. “their faces reflect forms; 48. “they have thin tongues, 49. “soft tongues, 50. “red tongues, 51. “voices like an elephant’s roar or like the sound of thunder, 5 . “voices that are pleasing and beautiful, 53. “round cuspids, 54. “sharp cuspids, 55. “white and level cuspids, 56. “regular cuspids, 57. “prominent noses, 58. “clean noses, 59. “wide eyes, 60. “elongated eyes, 61. “and thick eyelashes; 6 . “the white and black parts of their eyes are wide and beautiful like the petals of a blue lotus; 63. “their chests are broad, tall, and firm; 64. “they have long eyebrows, 65. “smooth eyebrows, 66. “eyebrows with even hair, 67. “glossy eyebrows, 68. “full, long ears, 69. “level ears, 70. “unimpaired ear faculties, 71. “well-shaped foreheads, 7 . “wide foreheads, 73. “perfect heads, 74. “hair black like bees, 75. “thick hair, 76. “smooth hair, 77. “hair that is not disheveled, 78. “hair that is not rough, 79. “and fragrant hair;

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་སེན་མོ་ཟངས་ཀྱི་མདོག་ལྟ་བུ་དང་། སེན་མོ་མདོག་སྣུམ་པ་དང་། སེན་མོ་མཐོ་བ་དང་། སེན་མོ་རྣམས་ཟླུམ་པ་དང་། སོར་མོ་རྣམས་རྒྱས་པ་དང་། སོར་མོ་རྣམས་བྱིན་གྱིས་ཕྲ་བ་དང་། རྩ་མི་མངོན་པ་དང་རྩ་མདུད་པ་མེད་པ་དང་ལོང་བུ་མི་མངོན་པ་དང་ཞབས་མི་མཉམ་པ་མེད་པ་དང་། སེང་གེའི་སྟབས་སུ་གཤེགས་པ་དང་། གླང་པོ་ཆེའི་སྟབས་སུ་གཤེགས་པ་དང་། ངང་པའི་སྟབས་སུ་གཤེགས་པ་དང་། ཁྱུ་མཆོག་གི་སྟབས་སུ་གཤེགས་པ་དང་། གཡས་ཕྱོགས་སུ་ལྡོག་ཅིང་གཤེགས་པ་དང་། མཛེས་པར་གཤེགས་པ་དང་། མི་གཡོ་བར་གཤེགས་པ་དང་། སྐུ་འཁྲིལ་བག་ཆགས་པ་དང་། སྐུ་བྱི་དོར་བྱས་པ་ལྟ་བུ་དང་། སྐུ་རིམ་པར་འཚམ་པ་དང་། སྐུ་ཁོ་ལག་ཡངས་ཤིང་བཟང་བ་དང་། མཚན་ཡོངས་སུ་རྫོགས་པ་དང་། གོམ་པ་སྙོམས་པ་དང་། སྐུ་གཙང་བ་དང་། སྐུ་འཇམ་པ་དང་། སྐུ་རྣམ་པར་དག་པ་དང་། སྐུ་ཞུམ་པ་མེད་པ་དང་། སྐུ་རྒྱས་པ་དང་། སྐུ་ཤིན་ཏུ་གྲིམས་པ་དང་། ཡན་ལག་དང་ཉིང་ལག་ཤིན་ཏུ་རྣམ་པར་འབྱེས་པ་དང་། གཟིགས་པ་རབ་རིབ་མེད་ཅིང་རྣམ་པར་དག་པ་དང་། དཀུ་ཟླུམ་པ་དང་དཀུ་སྐབས་ཕྱིན་པ་དང་དཀུ་མ་རྙོངས་པ་དང་། ཕྱལ་ཕྱམ་མེ་བ་དང་ལྟེ་བ་ཟབ་པ་དང་། ལྟེ་བ་གཡས་ཕྱོགས་སུ་འཁྱིལ་པ་དང་། ཀུན་ནས་མཛེས་པ་དང་། ཀུན་ཏུ་སྤྱོད་པ་གཙང་བ་དང་། སྐུ་ལ་སྨེ་བ་དང་གནག་བག་མེད་པ་དང་། ཕྱག་ཤིང་བལ་ལྟར་ཤིན་ཏུ་འཇམ་པ་དང་། ཕྱག་གི་རི་མོ་མདངས་ཡོད་པ་དང་། ཕྱག་གི་རི་མོ་ཟབ་པ་དང་། ཕྱག་གི་རི་མོ་རིང་བ་དང་། ཞལ་ཧ་ཅང་ཡང་མི་རིང་བ་དང་། ཞལ་ལ་གཟུགས་ཀྱི་གཟུགས་བརྙན་སྣང་བ་དང་། ལྗགས་སྲབ་པ་དང་། ལྗགས་འཇམ་པ་དང་། ལྗགས་དམར་བ་དང་། གླང་པོ་ཆེའི་ང་རོ་དང་། འབྲུག་གི་སྒྲ་དང་ལྡན་པ་དང་། གསུང་སྙན་ཅིང་མཉེན་ལ་འཇམ་པ་དང་། མཆེ་བ་ཟླུམ་པ་དང་། མཆེ་བ་རྣོ་བ་དང་། མཆེ་བ་དཀར་བ་དང་། མཉམ་པ་དང་། མཆེ་བ་བྱིན་གྱིས་ཕྲ་བ་དང་། ཤངས་མཐོ་བ་དང་། ཤངས་གཙང་བ་དང་། སྤྱན་ཡངས་པ་དང་། སྤྱན་རིང་བ་དང་། རྫི་མ་སྟུག་པ་དང་། སྤྱན་དཀར་གནག་འབྱེས་ཤིང་ཨུད་པ་ལའི་འདབ་མ་ཡངས་པ་ལྟ་བུར་འདུག་པ་དང་། བྲང་ཆེ་ཞིང་རྒྱས་ལ་མཁྲེགས་པ་དང་། སྨིན་ཚུགས་རིང་བ་དང་། སྨིན་མ་འཇམ་པ་དང་། སྨིན་མའི་སྤུ་མཉམ་པ་དང་སྨིན་མ་སྣུམ་པ་དང་། སྙན་ཤལ་སྟུག་ཅིང་རིང་བ་དང་། སྙན་མཉམ་པ་དང་། སྙན་གྱི་དབང་པོ་མ་ཉམས་པ་དང་། དཔྲལ་བ་ལེགས་པར་འབྱེས་པ་དང་། དཔྲལ་བའི་དབྱེས་ཆེ་བ་དང་། དབུ་ཤིན་ཏུ་རྒྱས་པ་དང་། དབུ་སྐྲ་བུང་བ་ལྟར་གནག་པ་དང་། དབུ་སྐྲ་སྟུག་པ་དང་། དབུ་སྐྲ་འཇམ་པ་དང་། དབུ་སྐྲ་མ་འཛིངས་པ་དང་། དབུ་སྐྲ་མི་གཤོར་བ་དང་། དབུ་སྐྲ་དྲི་ཞིམ་པ་དང་། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཕྱག་དང་ཞབས་དཔལ་གྱི་བེའུ་དང་། བཀྲ་ཤིས་དང་། གཡུང་དྲུང་འཁྱིལ་པ་དང་འཁོར་ལོ་དང་རྡོ་རྗེ་དང་པད་མ་དང་ཉ་ལ་སོགས་པའི་མཚན་ཡོད་པ་ཡིན་ཏེ།
en: “and the buddhas, the bhagavats, have marks like the śrīvatsa, the svastika, the nandyāvarta, the wheel, the vajra, the lotus, the fish, and so forth on the palms of their hands and on the soles of their feet.

source: འདི་དག་ནི་དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུའོ།
en: “These are the eighty minor marks.

source: །དགེ་སློང་དག་ཁྱེད་ལ་ཆོས་བཤད་པར་བྱ་སྟེ། ཚངས་པར་སྤྱོད་པ་དང་ཐོག་མར་དགེ་བ། བར་དུ་དགེ་བ། ཐ་མར་དགེ་བ་དང་། དོན་བཟང་པོ།
en: “I had said, ‘Bhikṣus, I will teach you the Dharma that is auspicious in the beginning, auspicious in the middle, auspicious in the end, that has good meaning and is well expressed.

source: ཚིག་འབྲུ་བཟང་པོ་མ་འདྲེས་པ། ཡོངས་སུ་རྫོགས་པ། ཡོངས་སུ་དག་པ། ཡོངས་སུ་བྱང་བ་འདི་ལྟ་སྟེ། དོན་རྣམ་པར་ངེས་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་རྣམ་གྲངས་ཡང་དག་པར་རབ་ཏུ་བཤད་པར་བྱ་ཞེས་གང་སྨྲས་པ་དེ་ནི་བཤད་པ་འདི་ཡིན་ནོ། །དགེ་སློང་དག་འདི་དག་ནི་དགོན་པའི་གནས་སམ།
en: I will clarify the unique, complete, pure, and purified Brahman conduct, the Dharma instruction Distinctly Ascertaining the Meanings .’ Thus, I have now explained what I had said I would.

source: ཤིང་དྲུང་ངམ། ཁང་སྟོང་ངམ། རི་སུལ་ལམ། རི་ཕུག་གམ་སོག་ཁྲོད་དམ། བླ་གབ་མེད་པའམ།
en: “Bhikṣus, dwell in forests, under trees, in empty dwellings, in mountain glens and rocky caves, in heaps of straw, in spaces out in the open, in charnel grounds, in forest glades, or in border regions.

source: དུར་ཁྲོད་དམ། ནགས་ཚལ་གྱི་མཐོངས་སམ།
en: Meditate with certainty.

source: བས་མཐའི་མལ་སྟན་དག་ཏུ་ངེས་པར་བསམ་གཏན་དུ་གྱིས་ཤིག །དགེ་སློང་དག་བག་མེད་པར་གྱུར་ནས་ཕྱིས་འགྱོད་པར་གྱུར་ཏ་རེ།
en: Bhikṣus, if you become careless, you will regret it later.

source: འདི་ནི་ངེད་ཀྱིས་རྗེས་སུ་བསྟན་པའོ།
en: This is my instruction.”

source: །ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཤད་པ་ན་དགེ་སློང་ལྔ་བརྒྱ་ཉེ་བར་ལེན་པ་མེད་པར་ཟག་པ་རྣམས་ལས་སེམས་རྣམ་པར་གྲོལ་ལོ།
en: As this Dharma instruction was being delivered, the minds of five hundred bhikṣus were liberated from the fluxes of clinging.

source: །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས།
en: Thus spoke the Bhagavat.

source: དགེ་སློང་དེ་དག་དང་ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་དང་། དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་དང་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་དག་ཡི་རངས་ཏེ། །བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ།
en: With their minds delighted, the bhikṣus, that entire assembly, and the world with its gods, humans, asuras, and gandharvas rejoiced at what the Bhagavat had said.

source: །དོན་རྣམ་པར་ངེས་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་རྣམ་གྲངས་རྫོགས་སོ།།
en: This completes the Dharma instruction “Distinctly Ascertaining the Meanings.”

source: །།རྒྱ་གར་གྱི་མཁན་པོ་ཛི་ན་མི་ཏྲ་དང་། པྲ་ཛྙཱ་བ་རྨ་དང་། ཞུ་ཆེན་གྱི་ལོ་ཙྪ་བ་བནྡེ་ཡེ་ཤེས་སྡེས་བསྒྱུར་ཅིང་ཞུས་ཏེ་གཏན་ལ་ཕབ་པ།།
en: This was translated, edited, and finalized by the Indian upādhyāyas Jinamitra and Prajñā­varman, and the chief editor-translator Bandé Yeshé Dé.
